app/views/projects/_form.html.erb


  <%= form.select :user, User.all.pluck(:name , :id) %>
---
SELECT "users"."name", "users"."id" FROM "users"