app/views/bugs/_form.html.erb

SELECT "users"."name", "users"."id" FROM "users"
---
    <%= form.label :creator_id %>
    <%= form.select :user, User.all.pluck(:name , :id) %>

SELECT "users"."name", "users"."id" FROM "users"
---
    <%= form.label :developer_id %>
    <%= form.select :user, User.all.pluck(:name , :id) %>

SELECT "projects"."name", "projects"."id" FROM "projects"
---
    <%= form.label :project_id %>
    <%= form.select :project, Project.all.pluck(:name , :id) %>