app/controllers/bugs_controller.rb

SELECT "bugs".* FROM "bugs"
---
  def index
    @bugs = Bug.all