app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "weatherman"], ["created_at", "2022-08-01 13:58:09.338853"], ["updated_at", "2022-08-01 13:58:09.338853"]]
---
  def create

    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "weatherman2j1"], ["updated_at", "2022-08-02 07:28:46.354836"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)